{
  "users": [
    {
      "firstName": "Joe",
      "lastName": "Smith",
      "emailAddress": "joe@smith.com",
      "password": "joepassword"
    },
    {
      "firstName": "Kyle",
      "lastName": "Cook",
      "emailAddress": "Kyle@Cook.com",
      "password": "KyleCookpassword"
    }
  ],
  "courses": [
    {
      "userId": 1,
      "title": "Software Development",
      "description": "This course is designed to introduce and explore fundamental software programming concepts and problem solving processes. You will learn how to design, construct and test general computer applications using structural programming techniques. Emphasis is on establishing a solid understanding of current products, programming practices, tools, and methodologies as they relate to common business applications.",
      "estimatedTime": "80",
      "materialsNeeded": "* Microsoft Visual C# Step by Step\n* Notebook computer running Mac OS X or Windows\n* VS code Text editor\n* Git and GitHub"
    },
    {
      "userId": 2,
      "title": "Learn How to Program Basic Javascript",
      "description": "In this course, you'll learn how to write Javascript.This course if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced courses more prepared.  At the end of every section, we will jump into this small application together, and practice everything we covered in the past lectures. This approach will make sure that you can retain the information you learned longer.   Once you know the major parts of the Javascript language, everything else will be very easy to learn, and that is exactly what this course will provide you.  ",
      "estimatedTime": "20",
      "materialsNeeded": "* Notebook computer running Mac OS X or Windows\n* VS code Text editor"
    },
    {
      "userId": 2,
      "title": "Learn How to run unit test with Jest",
      "description": "In this course, you'll learn how to run unit test with Jest.What you will learn, Write unit, integration and functional tests for React, Hooks, Contex and Redux using Jest and Enzyme.Know the tradeoffs for different testing approaches and when to choose which approach.Plan your React app more effectively via Test Driven Development.Mock methods and modules to keep your tests isolated.",
      "estimatedTime": "10",
      "materialsNeeded": "* Notebook computer running Mac OS X or Windows\n* VS code Text editor\n* Jest "
    }
  ]
}